{"meta":{"title":"欧阳桑的博客","subtitle":"","description":"","author":"Stephen Aerin","url":"http://yoursite.com","root":"/"},"pages":[],"posts":[{"title":"时空自适应反射率融合模型（STARFM）详细介绍","slug":"时空自适应反射率融合模型（STARFM）详细介绍","date":"2019-11-03T16:08:10.000Z","updated":"2019-11-04T02:43:58.256Z","comments":true,"path":"2019/11/04/时空自适应反射率融合模型（STARFM）详细介绍/","link":"","permalink":"http://yoursite.com/2019/11/04/%E6%97%B6%E7%A9%BA%E8%87%AA%E9%80%82%E5%BA%94%E5%8F%8D%E5%B0%84%E7%8E%87%E8%9E%8D%E5%90%88%E6%A8%A1%E5%9E%8B%EF%BC%88STARFM%EF%BC%89%E8%AF%A6%E7%BB%86%E4%BB%8B%E7%BB%8D/","excerpt":"","text":"一、解决的问题Landsat卫星自发射以后，在全球范围内取得了巨大的成功，其合理的波段设置、较好的空间分辨率以及数据的生产模型和精度控制，为反演地表参量，获取地表参数带来很大价值。但是其应用也受到很多因素的限制，例如16天的重放周期、云的污染等等，都给其应用带来了很大的困难。16天的重访周期对于地表变化较缓慢捕捉效果可以接受，但是在地表发生重大的变化，例如植被生长季周期内，其16天周期较长，且获得的影响很有可能被云污染，导致在生长季研究区域内部没有观测记录可用。STARFM模型就是在这样的情况下提出来的。为了改善Landsat影像重访周期所造成的观测数据不足的问题，Gao Feng等人在2006年首次提出了将MODIS数据与landsat影像融合以生成具有长时间序列的高空间分辨率遥感反射率数据，用于辅助获取地表参量。 二、模型简介STARFM模型的基本思想是将Landsat高空间分辨率和MODIS的高时间分辨率的优势结合起来。利用数学模型，通过使用在观测时间段内使用多对（实际操作下为两对）同一时间下获取的影像，结合在预测日期粗空间分辨率的反射率数据，计算得到在两幅Landsat影像时间段内无观测影像的高分辨率反射率数据。该模型本质上是通过在定义的搜索窗（searching window）内，通过非监督分类以及阈值分割判定与中心像元光谱特征相似的像元，对这些像元进行筛选（sample filtering），获得能提供有效反射率信息的像元，对有效像元反射率通过组合加权的方法来整合以计算中心像元，也即预测日期时刻某一位置反射率的值。 从数据的角度上来说，通常一个粗空间分辨率像元的反射率可以通过该像元范围内各精细空间分辨率反射率值与其对整体的贡献比加权求和得到（具体公式见理论基础部分），但是现在已知的是一个粗空间分辨率像元的反射率值，即使在知道每个像元的贡献率情况下，需要通过该方式反解精细空间分率的值也是很难的。因此Gao Feng等人提出通过周围的像元反射率值得到预测信息。该模型预测的关键是：寻找与待预测位置像元光谱特征相似且无云污染的邻近像元。 三、理论基础该部分阐述模型建模思想。在STARFM模型中，首先需要对Landsat和MODIS数据进行预处理（辐射定标、大气校正等），获取地面反射率。比较Landsat和MODIS数据的差异，可以发现两者在反射率上基本一致，但是存在一些差异，这通常是由于两者传感器获取的时间、数据生产方式、地理位置等因素造成的，这样的差异可以归为系统误差。通常，我们可以认为一个粗空间分辨率（MODIS）像元的反射率可以通过其像元范围内部精细空间分辨率值及其各自所占丰度表示，具体公式可以表示成： 其中F表示精细空间分辨率的地表反射率，A表示该位置下的丰度。我们需要解决的问题如何通过粗糙的空间分辨率的反射率值（此处即C）生成预测精细空间分辨率的地表反射率（此处即F），即使我们知道预测时刻每个像元所占的丰度且假设不随时间变化，从C的值反推其范围内的每个像元的反射率在数学上仍然是非常困难的。至此可以肯定通过该方式行不通，需要转换思路。因此Gao Feng等人设想能否通过邻近像元的信息来得到精细空间分辨率的反射率。首先可以认为，Landsat影像的反射率可以通过MODIS观测记录加上两者的差异值，即表示成： 同样的在时间T0(待预测时间)，也有类似的表达： 如果随着时间变化，地表的状态不变，此时可以认为两个时间下两种数据的差异是一样的，即有 对此进行变换，可以得到在T0时刻，所预测的精细空间反射率值： 然而这是在地表状态不发生变化的情况下才会有的结果，在自然状态下，这样的情况很难达到，主要有一下三个因素会影响地表状态： 在以Landsat的空间分辨率考虑的情况下，MODIS观测记录中不是一个同质像元，其一个像元可能会包含着不同的地物类别； 在预测时间之内，地物类别可能会从一种变为另外一类（例如裸地变为建筑物）； 地物类别不变，但地物的状态（物候）和太阳几何双向反射分布函数(BRDF,solar geometry bidirectional reflectance distribution function)的改变也会改变反射率。 只使用中心像元处的值预测没有考虑上诉三个因素，是不符合实际的。而中心像元计算的结果确实反映了预测日期的一部分信息，因此在STARFM中，此处使用中心像元周围的像元信息来进行预测，每一个待定的像元都会进行一次估算，对每次估算的结果赋予一个权重值，加权所得作为预测像元的值。至此，待预测的像元的值可以表示为： 这个idea带出来两个关键的概念：一是搜索窗(searching window);二是光谱相似像元(spectrally similar neighbor pixels)。搜索窗口的大小可以自己指定，该模型成败的关键是是否能寻找到与中心像元光谱特征相似的像元。合理的选择结果能够为预测提供增益效果，若使用了错误的像元，其效果反而会变差。 四、模型实现此部分阐述如何将一个数学模型变成一个可以在计算机实现并且可以评价预测结果所需要考虑的方面 （一）寻找光谱相似的邻近像元上面提到，这一步是成败的关键。如何通过影像来判断什么样的像元是与中心像元光谱特征相似的，这一步一般有以下两种处理方法：一：非监督分类，此处使用的是红光波段和近红外波段值。二：阈值分割设定阈值，根据指定的波段对波段值进行划分。 （二）权重函数的设置判断一个像素点计算的结果赋予多大的权重，是模型应用的另外一个关键。从通过以下三个方面来确定权重的大小： 同一时间下Landsat与MODIS反射率的差异越小，其对应位置的权重越大，公式表达为: 给定时刻T1与预测时刻T0MODIS数据反射率的差异越小，其对应位置权重越大，公式表达为： 距离搜索窗中心像元越近的像元所占的权重越大，公式表达为： 在距离权重中，计算的是某像元与中心像元的欧式距离，在模型中一般需要转换为相对距离，将量纲去掉，计算方式如下： 其中A是一个距离常数，用以表示空间距离相对于光谱和时间距离的差异，可以自己指定，在论文中曾设置为750m，具体情况具体分析。上诉三个因素可以判断一个位置的权重，但是需要综合考虑以上三个因素，得出最后的综合权重值，该指标可以有两种定义方式。 其一为： 其二为： 最后的权重计算如下： （三）样本过滤(sample filtering)在经过非监督分类之后，得到了与中心像元光谱信息类似的像元。但是此时并非每个待定的像元都可以为预测中心像元提供增益效果，需要对待定像元进行筛选。筛选的规则如下：剔除受到云的影像的像元；如果邻近像元不能够提供比中心像元更好的光谱和空间信息，剔除。第二个条件在数学上的表示为： 上诉筛选条件没有考虑地理位置、大气校正方式差异带来的不确定性，因此为了完善模型，通常会在两个筛选条件后面加上此不确定度，分别设Landsat和MODIS数据不确定度为和。完善之后的表达式为： 光谱差异： 时间差异： 参考光谱差异和时间差异的计算方式，有以下： 和 模型计算流程STARFM模型可以看成是一个领域运算，每次运算都遵循相同的步骤。搜索窗的大小根据图像特征自己确定，每一次估算一个像元的反射率时，都大致以下图的步骤。 具体流程可以如下图所示： 【该图片来自于论文On the Blending of the Landsat and MODIS Surface: Predicting Daily Landsat Surface Reflectance】 计算流程做以下说明，使用T1时刻获取的一对不同空间分辨率的影像对加上预测时刻MODIS的观测值，生成T0时刻下精细空间分辨率的反射率产品。该图是计算一个中心像元所经过的流程，所示范围为一个搜索窗。首先对数据进行预处理得到地表的反射率，对MODIS数据进行重采样，使空间分辨率和Landsat影像相同。步骤（1）是对Landsat影像进行非监督分类，得到与中心像元光谱类似的像元；步骤（2）是对非监督分类的结果进行筛选；（3）步骤通过权重计算公式计算各个邻近像元的权重大小，颜色越深表示权重相应越大。步骤（4）是加权计算中心像元T0时刻的反射率。每个像元都经过以上流程，得到最后的预测时刻研究区域精细空间分辨率的反射率影像。 五、模型应用及不足Gao Feng等人对该模型做了大量的模拟实验，测试了模型在不同变化反射率，不同变化形状等情况下的表现。同时使用了Landsat和MODIS的观测数据对不同地物变化特征区域进行了检验。发现该算法可以较好的捕捉植被的物候变化，同时能保留空间细节的信息。但是在测试区域十分异质时，模型预测比较困难。该算法更多适用于地物覆盖上同质的像元，且这样的像元越多，预测效果越好。同时在地表变化非常微小不能被MODIS记录或者在Landsat影像中无可用的数据时，不能进行很好的预测。总体来说，这个算法开创了遥感数据融合的先河，具有很大的借鉴价值。之后的一些数据融合的算法也是在这个基础思路上改进的。它可以推广到其它类型的遥感数据融合，例如欧空局的哨兵数据和MODIS数据融合。 注：该博文更多的是参考Gao Feng、Jeff Masek等人于2006年在IEEE TRANSACTIONS ON GEOSCIENCE AND REMOTE SENDING发表的论文:On the Blending of the Landsat and MODIS Surface: Predicting Daily Landsat Surface Reflectance（VOL.44, NO.8,AUGUST 2006)，更多细节请参考此篇文献。 另本博文未经允许禁止转载，转载请注明来源。","categories":[],"tags":[{"name":"数据融合","slug":"数据融合","permalink":"http://yoursite.com/tags/%E6%95%B0%E6%8D%AE%E8%9E%8D%E5%90%88/"}]},{"title":"Hello World","slug":"hello-world","date":"2019-11-03T10:13:19.830Z","updated":"2019-11-03T10:13:19.830Z","comments":true,"path":"2019/11/03/hello-world/","link":"","permalink":"http://yoursite.com/2019/11/03/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]},{"title":"我的研究生生活","slug":"我的研究生生活","date":"2019-09-24T10:06:24.000Z","updated":"2019-11-03T11:13:03.444Z","comments":true,"path":"2019/09/24/我的研究生生活/","link":"","permalink":"http://yoursite.com/2019/09/24/%E6%88%91%E7%9A%84%E7%A0%94%E7%A9%B6%E7%94%9F%E7%94%9F%E6%B4%BB/","excerpt":"","text":"定量遥感实验室：蔡文婷师姐找工作加油—-王亚梅师姐实习冲冲冲—-彭凡晨师兄做游戏牛逼—- 210小张小张，天下无双小庞小庞，气宇轩昂欧阳欧阳，地表最强check","categories":[],"tags":[{"name":"545实验室","slug":"545实验室","permalink":"http://yoursite.com/tags/545%E5%AE%9E%E9%AA%8C%E5%AE%A4/"}]}]}